CREATE TABLE TB_BOARD (
	board_number INT(10) AUTO_INCREMENT,
	board_title VARCHAR(200) NOT NULL,
	board_content VARCHAR(2000) NOT NULL,
	board_time TIMESTAMP NOT NULL default current_timestamp,
	member_number INT(10),
	PRIMARY KEY (board_number),
	FOREIGN KEY (member_number) REFERENCES TB_MEMBER(member_number)
);

insert into TB_BOARD (
    board_title,
   board_content,
   board_time,
    member_number
)
values
("글램핑할려?0, "캠핑장으로 모두모두 나와바리~","2023-07-1",7),
("글램핑할려?1, "캠핑장으로 모두모두 나와바리~","2023-07-2",12),
("글램핑할려?2, "캠핑장으로 모두모두 나와바리~","2023-07-3",11),
("글램핑할려?3, "캠핑장으로 모두모두 나와바리~","2023-07-4",19),
("글램핑할려?4, "캠핑장으로 모두모두 나와바리~","2023-07-5",20),
("글램핑할려?5, "캠핑장으로 모두모두 나와바리~","2023-07-6",11),
("글램핑할려?6, "캠핑장으로 모두모두 나와바리~","2023-07-7",15),
("글램핑할려?7, "캠핑장으로 모두모두 나와바리~","2023-07-8",17),
("글램핑할려?8, "캠핑장으로 모두모두 나와바리~","2023-07-9",15),
("글램핑할려?9, "캠핑장으로 모두모두 나와바리~","2023-07-10",14),
("글램핑할려?10, "캠핑장으로 모두모두 나와바리~","2023-07-11",16),
("글램핑할려?11, "캠핑장으로 모두모두 나와바리~","2023-07-12",8),
("글램핑할려?12, "캠핑장으로 모두모두 나와바리~","2023-07-13",13),
("글램핑할려?13, "캠핑장으로 모두모두 나와바리~","2023-07-14",13),
("글램핑할려?14, "캠핑장으로 모두모두 나와바리~","2023-07-15",15),
("글램핑할려?15, "캠핑장으로 모두모두 나와바리~","2023-07-16",3),
("글램핑할려?16, "캠핑장으로 모두모두 나와바리~","2023-07-17",16),
("글램핑할려?17, "캠핑장으로 모두모두 나와바리~","2023-07-18",3),
("글램핑할려?18, "캠핑장으로 모두모두 나와바리~","2023-07-19",19),
("글램핑할려?19, "캠핑장으로 모두모두 나와바리~","2023-07-20",19),
("글램핑할려?20, "캠핑장으로 모두모두 나와바리~","2023-07-21",7),
("글램핑할려?21, "캠핑장으로 모두모두 나와바리~","2023-07-22",6),
("글램핑할려?22, "캠핑장으로 모두모두 나와바리~","2023-07-23",9),
("글램핑할려?23, "캠핑장으로 모두모두 나와바리~","2023-07-24",16),
("글램핑할려?24, "캠핑장으로 모두모두 나와바리~","2023-07-25",17),
("글램핑할려?25, "캠핑장으로 모두모두 나와바리~","2023-07-26",10),
("글램핑할려?26, "캠핑장으로 모두모두 나와바리~","2023-07-27",20),
("글램핑할려?27, "캠핑장으로 모두모두 나와바리~","2023-07-28",19),
("글램핑할려?28, "캠핑장으로 모두모두 나와바리~","2023-07-29",5),
("글램핑할려?29, "캠핑장으로 모두모두 나와바리~","2023-07-30",13),
("글램핑할려?30, "캠핑장으로 모두모두 나와바리~","2023-07-31",20),
("글램핑할려?31, "캠핑장으로 모두모두 나와바리~","2023-08-1",12),
("글램핑할려?32, "캠핑장으로 모두모두 나와바리~","2023-08-2",7),
("글램핑할려?33, "캠핑장으로 모두모두 나와바리~","2023-08-3",19),
("글램핑할려?34, "캠핑장으로 모두모두 나와바리~","2023-08-4",19),
("글램핑할려?35, "캠핑장으로 모두모두 나와바리~","2023-08-5",12),
("글램핑할려?36, "캠핑장으로 모두모두 나와바리~","2023-08-6",11),
("글램핑할려?37, "캠핑장으로 모두모두 나와바리~","2023-08-7",6),
("글램핑할려?38, "캠핑장으로 모두모두 나와바리~","2023-08-8",18),
("글램핑할려?39, "캠핑장으로 모두모두 나와바리~","2023-08-9",2),
("글램핑할려?40, "캠핑장으로 모두모두 나와바리~","2023-08-10",14),
("글램핑할려?41, "캠핑장으로 모두모두 나와바리~","2023-08-11",9),
("글램핑할려?42, "캠핑장으로 모두모두 나와바리~","2023-08-12",16),
("글램핑할려?43, "캠핑장으로 모두모두 나와바리~","2023-08-13",16),
("글램핑할려?44, "캠핑장으로 모두모두 나와바리~","2023-08-14",2),
("글램핑할려?45, "캠핑장으로 모두모두 나와바리~","2023-08-15",4),
("글램핑할려?46, "캠핑장으로 모두모두 나와바리~","2023-08-16",7),
("글램핑할려?47, "캠핑장으로 모두모두 나와바리~","2023-08-17",8),
("글램핑할려?48, "캠핑장으로 모두모두 나와바리~","2023-08-18",1),
("글램핑할려?49, "캠핑장으로 모두모두 나와바리~","2023-08-19",14),
("글램핑할려?50, "캠핑장으로 모두모두 나와바리~","2023-08-20",20),
("글램핑할려?51, "캠핑장으로 모두모두 나와바리~","2023-08-21",1),
("글램핑할려?52, "캠핑장으로 모두모두 나와바리~","2023-08-22",10),
("글램핑할려?53, "캠핑장으로 모두모두 나와바리~","2023-08-23",12),
("글램핑할려?54, "캠핑장으로 모두모두 나와바리~","2023-08-24",6),
("글램핑할려?55, "캠핑장으로 모두모두 나와바리~","2023-08-25",6),
("글램핑할려?56, "캠핑장으로 모두모두 나와바리~","2023-08-26",9),
("글램핑할려?57, "캠핑장으로 모두모두 나와바리~","2023-08-27",11),
("글램핑할려?58, "캠핑장으로 모두모두 나와바리~","2023-08-28",6),
("글램핑할려?59, "캠핑장으로 모두모두 나와바리~","2023-08-29",7),
("글램핑할려?60, "캠핑장으로 모두모두 나와바리~","2023-08-30",9),
("글램핑할려?61, "캠핑장으로 모두모두 나와바리~","2023-08-31",5),
("글램핑할려?62, "캠핑장으로 모두모두 나와바리~","2023-09-1",16),
("글램핑할려?63, "캠핑장으로 모두모두 나와바리~","2023-09-2",2),
("글램핑할려?64, "캠핑장으로 모두모두 나와바리~","2023-09-3",11),
("글램핑할려?65, "캠핑장으로 모두모두 나와바리~","2023-09-4",1),
("글램핑할려?66, "캠핑장으로 모두모두 나와바리~","2023-09-5",14),
("글램핑할려?67, "캠핑장으로 모두모두 나와바리~","2023-09-6",18),
("글램핑할려?68, "캠핑장으로 모두모두 나와바리~","2023-09-7",7),
("글램핑할려?69, "캠핑장으로 모두모두 나와바리~","2023-09-8",15),
("글램핑할려?70, "캠핑장으로 모두모두 나와바리~","2023-09-9",6),
("글램핑할려?71, "캠핑장으로 모두모두 나와바리~","2023-09-10",14),
("글램핑할려?72, "캠핑장으로 모두모두 나와바리~","2023-09-11",15),
("글램핑할려?73, "캠핑장으로 모두모두 나와바리~","2023-09-12",6),
("글램핑할려?74, "캠핑장으로 모두모두 나와바리~","2023-09-13",11),
("글램핑할려?75, "캠핑장으로 모두모두 나와바리~","2023-09-14",13),
("글램핑할려?76, "캠핑장으로 모두모두 나와바리~","2023-09-15",13),
("글램핑할려?77, "캠핑장으로 모두모두 나와바리~","2023-09-16",16),
("글램핑할려?78, "캠핑장으로 모두모두 나와바리~","2023-09-17",15),
("글램핑할려?79, "캠핑장으로 모두모두 나와바리~","2023-09-18",1),
("글램핑할려?80, "캠핑장으로 모두모두 나와바리~","2023-09-19",14),
("글램핑할려?81, "캠핑장으로 모두모두 나와바리~","2023-09-20",4),
("글램핑할려?82, "캠핑장으로 모두모두 나와바리~","2023-09-21",19),
("글램핑할려?83, "캠핑장으로 모두모두 나와바리~","2023-09-22",19),
("글램핑할려?84, "캠핑장으로 모두모두 나와바리~","2023-09-23",9),
("글램핑할려?85, "캠핑장으로 모두모두 나와바리~","2023-09-24",20),
("글램핑할려?86, "캠핑장으로 모두모두 나와바리~","2023-09-25",3),
("글램핑할려?87, "캠핑장으로 모두모두 나와바리~","2023-09-26",4),
("글램핑할려?88, "캠핑장으로 모두모두 나와바리~","2023-09-27",12),
("글램핑할려?89, "캠핑장으로 모두모두 나와바리~","2023-09-28",5),
("글램핑할려?90, "캠핑장으로 모두모두 나와바리~","2023-09-29",1),
("글램핑할려?91, "캠핑장으로 모두모두 나와바리~","2023-09-30",8),
("글램핑할려?92, "캠핑장으로 모두모두 나와바리~","2023-10-0",10),
("글램핑할려?93, "캠핑장으로 모두모두 나와바리~","2023-10-1",10),
("글램핑할려?94, "캠핑장으로 모두모두 나와바리~","2023-10-2",15),
("글램핑할려?95, "캠핑장으로 모두모두 나와바리~","2023-10-3",18),
("글램핑할려?96, "캠핑장으로 모두모두 나와바리~","2023-10-4",1),
("글램핑할려?97, "캠핑장으로 모두모두 나와바리~","2023-10-5",8),
("글램핑할려?98, "캠핑장으로 모두모두 나와바리~","2023-10-6",14),
("글램핑할려?99, "캠핑장으로 모두모두 나와바리~","2023-10-7",16);

--    public static void main(String[] args) {
--        for (int i = 0; i < 100; i++) {
--            int a=0;
--            System.out.print("(");
--            System.out.print("\"글램핑할려?" + i + ", \"캠핑장으로 모두모두 나와바리~\",\"");
--            if (i < 31) {
--                System.out.print("2023-07-" + (i+1));
--            } else if (i >= 31 && i<62) {
--                System.out.print("2023-08-" + (i-30));
--            }else if(i >= 62 && i<92){
--                System.out.print("2023-09-" + (i-61));
--            } else if(i >=92){
--                System.out.print("2023-10-" + (i-92));
--            }
--            System.out.print("\"," +  (int)(Math.random() * (21 - 1) + 1));
--            System.out.print("),");
--            System.out.println();
--
--        }
--    }